import PropTypes from 'prop-types'
import { Link, withTranslation, i18n } from '../../../i18n'
import Layout from '../../components/Layout/Layout'
import Head from 'next/head'
import { Breadcrumb } from 'antd';

import { HomeOutlined } from '@ant-design/icons';
import styles from '../../styles/Home.module.css'
import { Row, Col } from 'antd'

const PouyaPasswordPage = ({ t }) => (
  <Layout>
    <Head>
        <title>نحوه دریافت رمز پویا (رمز دوم یکبار مصرف) از تمام بانک‌ها</title>
    </Head>
      <div
        className={`${styles.otherPage} ${process.env.THEME_NAME === "TRAVELO" && styles.otherPageTravelo}`}
        >
        <div className={styles.container}>
            <Row>
                <Breadcrumb>
                    <Breadcrumb.Item>
                    <Link as="/" href="/">
                        <a>
                        <HomeOutlined />
                        </a>
                    </Link>
                    </Breadcrumb.Item>
                    <Breadcrumb.Item>
                    <span>نحوه دریافت رمز پویا (رمز دوم یکبار مصرف) از تمام بانک‌ها</span>
                    </Breadcrumb.Item>
                </Breadcrumb>
          </Row>
          <Row>
              <div className={styles.pouyaPassword}>
                <h1>نحوه دریافت رمز پویا (رمز دوم یکبار مصرف) از تمام بانک‌ها</h1>
                <div className={styles.note}>
                    <span>از ابتدای دی ماه سال جاری، انجام تراکنش‌‌های بانکی و پرداخت‌های آنلاین در راستای بالا بردن سطح امنیت صرفا با استفاده از رمز پویا (رمز یکبار مصرف) امکان‌‌پذیر خواهد بود. برای دریافت رمز یکبار مصرف باید با همراه داشتن مدارک شناسایی خود به یکی از شعب بانک مورد نظر مراجعه کرده و مراحل دریافت رمز پویا را انجام دهید. در ادامه اطلاعات بیشتر جهت نحوه فعال‌سازی رمز پویا برای شما ارائه می‌شود.</span>
                </div>
                <div className={styles.content}>
                    <h2>بانک ملی ایران</h2>
                    <p>
                        <strong>روش اول:</strong>
                        را معرفی کرده تا کاربران بتوانند با استفاده از کدهای USSD و علاوه بر آن با بهره‌گیری از نرم‌افزار هوشمند، رمز یک بار مصرف خود را دریافت کنند. شما می‌توانید نرم‌افزار ۶۰ را دانلود کرده و با راهنمای فعالسازی آن سرویس ۶۰ ثانیه خود را فعال کنید. برای فعال‌سازی نرم‌افزار ۶۰ باید با یکی از سه روش مراجعه به سامانه بام، مراجعه به دستگاه‌های کیوسک و یا دستگاه‌های خودپرداز فعالسازی اولیه را انجام دهید و پس از آن رمز پویا برای شما در هر بار مراجعه به اپلیکیشن ۶۰، تولید خواهد شد.
                    </p>
                    <p>
                        <strong>روش دوم:</strong>
                        برای فعالسازی به روش USSD نیز می‌توانید با شماره‌گیری کد *۷۳۷*۶۰# کلیه عملیات ثبت‌نام اولیه، فعالسازی و تولید رمز را با این سامانه انجام دهید. این روش نیازی به اینترنت، گوشی هوشمند و نصب نرم‌افزار ندارد. در این مرحله پس از ثبت نام، کد فعالسازی اولیه با یک پیامک برای شما ارسال می‌شود که با وارد کردن آن می‌توانید از این پس با استفاده از روش USSD رمز پویای خود را در حین خریدهای اینترنتی دریافت و در صفحه خرید وارد کنید. 
                    </p>
                    
                    <h2>بانک سپه</h2>
                    <p>در حال حاضر بانک سپه فقط روش استفاده از نرم‌افزار را برای فعالسازی رمز پویا در دسترس کاربران خود قرار داده است. برای دسترسی به رمزهای پویا برای حساب‌های بانک سپه باید&nbsp;<a href="https://acc.ebanksepah.ir/mobile/">نرم‌افزار رمزساز سپه</a>&nbsp;را از وبسایت این بانک دریافت کنید. برای فعالسازی اولیه حتما لازم است به یکی از شعب بانک سپه در سراسر کشور مراجعه کنید چون امکان فعالسازی از طریق دریافت کد برای اولین بار روی گوشی‌های هوشمند و یا از طریق پیامک وجود ندارد. البته اگر از قبل سامانه مشتری محور بانک سپه را فعال کرده باشید، نیاز به هیچ عملیات دیگری نیست و با ورود به سامانه مشتری‌محور می‌توانید در همان صفحه، رمز یک بار مصرف خود را نیز دریافت کرده و استفاده کنید.</p>

                    <h2>بانک کشاورزی</h2>
                    <p>
                        <strong>روش اول:</strong>
                        کاربر می‌تواند با مراجعه به خودپردازهای بانک مربوطه و انتخاب گزینه فعالسازی رمز اول یا دوم یکبار مصرف، رمز مورد نظر خود را فعال نماید. در این مرحله، یک توکن دو بخشی شامل ۸ کاراکتر که از طریق رسید بانکی و مابقی آن از طریق پیامک به کاربر تحویل داده شده است، باید در محل مربوطه وارد شود.
                    </p>
                    <p>
                        <strong>روش دوم:</strong>
                        برای فعالسازی رمز دوم پویای بانک کشاورزی باید به سامانه جدید SOTP&nbsp;مراجعه کنید. برای استفاده از این سامانه مشتریان این بانک باید <a href="https://www.bki.ir/services/apps/otp">نرم‌افزار ریما</a>&nbsp;را از وب‌سایت بانک کشاورزی&nbsp;دانلود کنند.
پس از ورود رمزهای دریافتی با لمس کلید ثبت، هر ۶۰ ثانیه یک رمز جدید تولید خواهد شد که در برنامه قابل مشاهده است. افزودن توکن جدید با علامت «+» و مشاهده رمزهای یکبار مصرف تولید شده با علامت قفل امکانپذیر است.
                    </p>

                    <h2>بانک مسکن</h2>
                    <p>بانک مسکن برای این منظور نرم‌افزار <a href="https://www.bank-maskan.ir/maskan-otp">رمزنما</a> را معرفی کرده است.&nbsp;برای فعالسازی از طریق این نرم‌افزار نیاز است تا شما یک بار به خودپردازهای بانک مسکن مراجعه کنید. پس از مراجعه به دستگاه خودپرداز باید وارد بخش<strong> «خدمات رمز»</strong> و سپس بخش <strong>«خدمات دیگر»</strong> شوید و گزینه <strong>«تخصیص رمز دوم پویا»</strong> را انتخاب کنید. در این مرحله با وارد کردن شماره تلفن همراه خود (که باید منطبق بر شماره تلفن ثبت شده در شعبه بانک باشد)، رمز فعالسازی نرم‌افزار برای تلفن همراه شما ارسال می‌شود.</p>

                    <h2>بانک ملت</h2>
                    <p>فعالسازی رمز یک بار مصرف از طریق برنامه <strong><a href="https://www.bankmellat.ir/ramznegar.aspx">رمزنگار ملت</a></strong>&nbsp;انجام می‌شود. نرم‌افزار رمزنگار به مشتریان امکان می‌دهد علاوه بر استفاده از رمز پویا برای خریدهای اینترنتی، در تراکنش‌های مبتنی بر رمز اول نیز از آن استفاده کنند. برای فعالسازی برنامه رمزنگار ملت در مرحله اول نیاز به مراجعه حضوری به عابربانک‌های ملت است. در این مرحله باید کد دریافتی از عابربانک ملت را در نرم‌افزاری رمزنگار که از قبل دانلود و روی گوشی خود نصب کرده‌اید، وارد کرده و مراحل فعالسازی برنامه را تکمیل نمایید. بعد از این مرحله دیگر نیازی به فعالسازی نیست و برای خریدهای اینترنتی و یا عملیات دیگری که نیاز به رمز پویا دارند تنها کافیست به این نرم‌افزار روی گوشی خود مراجعه کنید.</p>

                    <h2>بانک تجارت</h2>
                    <p>این بانک برای ارائه خدمات رمز پویا به مشتریان خود نرم‌افزاری به نام <strong><a href="https://tejaratbank.ir/web_directory/2424-hamraz-software.html">همراز</a>&nbsp;</strong>را طراحی کرده است. در زمان نگارش این راهنما، تنها راهکار فعالسازی این نرم‌افزار مراجعه به دستگاه‌های عابربانک است. در این حالت پس از مراجعه به عابربانک و انتخاب گزینه <strong>«سایر خدمات»</strong> باید به بخش فعال‌سازی رمز پویا مراجعه کنید. پس از انجام فعالسازی، برای شما رسیدی صادر شده و پیامکی حاوی کد فعالسازی به شماره تلفن همراهی که در حین افتتاح حساب به آن متصل کرده‌اید ارسال می‌شود. کافیست رمز دریافتی را در نرم‌افزار همراز وارد کرده و باقی مراحل تنظیم نرم‌افزار را در آن ادامه دهید. برای هر بار دریافت رمز پویا، کافیست وارد نرم‌افزار همراز شوید.</p>

                    <h2>بانک دی</h2>
                    <p>بانک دی از جمله بانک‌هایی است که از <a href="https://cafebazaar.ir/app/com.tosan.mobiletoken">نرم‌افزار ارس</a>&nbsp;برای تولید رمز یک بار مصرف استفاده می‌کند. نحوه عملکرد این نرم‌افزار شبیه به نرم‌افزارهای دیگری است که از روش کد&nbsp;QR&nbsp;برای فعالسازی رمز یک بار مصرف استفاده می‌کنند. برای استفاده از این روش باید ابتدا&nbsp;نرم‌افزار ارس&nbsp;را دانلود و روی گوشی خود نصب کنید. سپس با دو روش می‌توانید رمز دوم یک بار مصرف خود را فعال کنید.</p>
                    <p><strong>روش اول:</strong>&nbsp;پس از دانلود و نصب برنامه ارس، به صورت حضوری به یکی از شعب بانک دی مراجعه کرده و درخواست&nbsp;صدور&nbsp;QR Code بدهید.&nbsp;پس از صدور&nbsp;QR Code&nbsp;می‌توانید آن را با نرم‌افزار اسکن کرده و همزمان کد پیامکی که بانک برای شما ارسال کرده است را برای فعالسازی رمز یک بار مصرف خود وارد نمایید. پس از انجام این مراحل، شما می‌توانید از رمز یکبار مصرف داخل نرم‌افزار ارس استفاده کنید.</p>
                    <p><strong>روش دوم:</strong>&nbsp;پس از دانلود و نصب برنامه ارس، با مراجعه به سامانه اینترنت بانک و بخش فعالسازی رمز دوم یک بار مصرف، درخواست&nbsp;صدور&nbsp;QR Code بدهید.&nbsp;پس از صدور&nbsp;QR Code&nbsp;می‌توانید آن را با نرم‌افزار اسکن کرده و همزمان کد پیامکی که بانک برای شما ارسال کرده است را برای فعالسازی رمز یک بار مصرف خود وارد نمایید. پس از انجام این مراحل، شما می‌توانید از رمز یکبار مصرف داخل نرم‌افزار ارس استفاده کنید.</p>

                    <h2>بانک اقتصاد نوین</h2>
                    <p>بانک اقتصاد نوین نیز از دسته بانک‌های ارائه‌دهنده <a href="https://cafebazaar.ir/app/com.tosan.mobiletoken">نرم‌افزاری ارس</a>&nbsp;برای تولید و استفاده از رمز یک بار مصرف است. در این حالت پس از&nbsp;دانلود نرم‌افزار ارس، دو روش برای فعالسازی رمز یک بار مصرف وجود دارد.</p>
                    <p>روش اول: با مراجعه حضوری به یکی از شعب این بانک می‌توانید&nbsp;QR Code&nbsp;صادره از بانک را همراه با کدی که از طریق پیامک، پس از پر کردن فرم‌های مربوطه در شعبه، برای شما پیامک شده را در ارس وارد کرده تا پس از چند مرحله ساده توانایی استفاده از رمز یک بار مصرف تولیدی نرم‌افزار را داشته باشید.</p>
                    <p><strong>روش دوم:</strong>&nbsp;به سامانه اینترنت بانک اقتصاد نوین مراجعه کنید. حتی اگر سامانه اینترنت بانک خود را از قبل فعال نکرده‌ باشید نیز می‌توانید با مراجعه به&nbsp;<a href="https://modern.enbank.ir/ibnew/login/userAccountPage.action?strategy=SIGN_UP&amp;lang=fa&amp;channel=INTERNET_BANK">سایت بانک اقتصاد نوین</a>&nbsp;هم اینترنت بانک خود را فعال کنید و هم از طریق <strong>«منوی کارت»</strong> بخش <strong>«فعالسازی رمز دوم یک بار مصرف کارت»</strong> عملیات فعالسازی رمز پویا را به صورت غیر حضوری انجام دهید.</p>


                    <h2>بانک سامان</h2>
                    <p><strong>روش اول:</strong> برای فعالسازی رمز پویا بانک سامان باید به یکی از شعب این بانک مراجعه کرده و درخواست فعالسازی را ثبت نمایید. پس از آن اپراتور شعبه یک کد&nbsp;QR&nbsp;در اختیار شما قرار می‌دهد که همراه با پیامک فعالسازی که برایتان ارسال شده، در حین فعالسازی مورد استفاده قرار خواهد گرفت.&nbsp;پس از دانلود و نصب برنامه اختصاصی بانک سامان که&nbsp;<a href="https://www.sb24.com/fa/saman-apps/ramzine">رمزینه</a>&nbsp;نام دارد، ابتدا باید کد&nbsp;QR&nbsp;دریافتی از شعبه را در محیط نرم‌افزار اسکن کرده و پس از آن کد ۶ رقمی صادره توسط شعبه یا نت‌بانک را داخل نرم‌افزار وارد می‌کنیم. باقی موارد تنها انتخاب رمز ورود به نرم‌افزار و چند مرحله ساده است و پس از آن می‌توانید با هر بار مراجعه به برنامه رمزینه، رمز یک‌ بار‌ مصرف خود را مشاهده و مورد استفاده قرار دهید.</p>
                    <p><strong>روش دوم:</strong> در صورت فعال بودن سامانه نت‌بانک سامان، می‌توانید با مراجعه به بخش <strong>«مدیریت کارت»</strong> و انتخاب گزینه <strong>«فعالسازی رمز دوم یکبار مصرف کارت»</strong> و پس از انتخاب کارت و<strong> «فعالسازی برنامک»</strong>، رمز ۶ رقمی جهت ورود به رمزینه را دریافت نموده و در نرم‌افزار مورد استفاده قرار دهید.&nbsp;پس از نصب برنامه <a href="https://www.sb24.com/fa/saman-apps/ramzine">رمزینه</a> ابتدا باید کد&nbsp;QR&nbsp;دریافتی از نت‌بانک را در محیط نرم‌افزار اسکن کرده و پس از آن کد ۶ رقمی صادره توسط شعبه یا نت‌بانک را داخل نرم‌افزار وارد می‌کنیم. باقی موارد تنها انتخاب رمز ورود به نرم‌افزار و چند مرحله ساده است و پس از آن می‌توانید با هر بار مراجعه به برنامه رمزینه، رمز یکبار‌مصرف خود را مشاهده و مورد استفاده قرار دهید.</p>

                    <h2>بانک گردشگری</h2>
                    <p>مشتریان این بانک می‌توانند رمز دوم یک بار مصرف خود را در هر دو سامانه اینترنت بانک و یا <a href="https://www.tourismbank.ir/mobilebank">نرم‌افزار همراه بانک گردشگری</a> دریافت کنند. در نرم‌افزار همراه بانک گردشگری تنها کافیست در منوی اصلی به بخش <strong>«عملیات کارت»</strong> رفته و در آنجا گزینه <strong>«فعال/غیرفعال&nbsp;سازی رمز یک بار مصرف کارت»</strong> را بزنید. در این مرحله لیستی از شماره کارت‌های متصل به شماره ملی شما نمایش داده خواهد شد.</p>
                    <p>با زدن دکمه دو وضعیتی می‌توانید به راحتی رمز دوم یک بار مصرف را فعال کنید. البته در روش اینترنتی همینطور است و پس از ورود به سامانه، باید به بخش <strong>«کارت‌های من»</strong> از منوی کارت مراجعه کنید. پس از انتخاب کارت مورد نظر باید <strong>«آیتم سه نقطه»</strong> را زده و در پنجره باز شده گزینه <strong>«مدیریت نوع رمز دوم»</strong> را کلیک کنید.</p>
                    <p>در این حالت نیز می‌توانید به راحتی کارت مد نظر را پیدا کرده و گزینه رمز دوم آن را فعال کنید. دقت داشته باشید که این مراحل امکان انجام داخل شعبه را نیز دارند و می‌توانید با مراجعه حضوری نیز رمز دوم پویا دریافت کنید.</p>

                </div>
              </div>
          </Row>
        </div>
      </div>
  </Layout>
)

PouyaPasswordPage.getInitialProps = async () => ({
  namespacesRequired: ['common'],
})

PouyaPasswordPage.propTypes = {
  t: PropTypes.func.isRequired,
}

export default withTranslation('common')(PouyaPasswordPage)