import PropTypes from 'prop-types'
import { Link, withTranslation, i18n } from '../../i18n'
import Layout from '../components/Layout/Layout'
import Head from 'next/head'
import { Row, Col, Breadcrumb } from 'antd'
import { HomeOutlined } from '@ant-design/icons'

import styles from '../styles/Home.module.css'

const PrivacyPage = ({ t }) => (
  <Layout>
    <Head>
        <title>{t("privacy")}</title>
    </Head>      
    <div
      className={`${styles.otherPage} ${process.env.THEME_NAME === "TRAVELO" && styles.otherPageTravelo}`}
      >
      <div className={styles.container}>
        <Row>
          <Breadcrumb>
              <Breadcrumb.Item>
              <Link as="/" href="/">
                  <a>
                  <HomeOutlined />
                  </a>
              </Link>
              </Breadcrumb.Item>
              <Breadcrumb.Item>
              <span>{t("privacy")}</span>
              </Breadcrumb.Item>
          </Breadcrumb>
        </Row>
        <Row>
            <Col span={24}>
                <div
                  className={`${styles.privacy} ${process.env.THEME_NAME === "TRAVELO" && styles.privacyTravelo}`}
                  >
                    <h1>{t("privacy")}</h1>
                    <div className={styles.content}>
                      <p>در وهله اول حریم خصوصی کاربران سامانه سفرانه برای ما در بالاترین درجه اهمیت قرار دارد. شما به خدمات ارائه شده از سمت ما اعتماد می‌کنید و ما برای این اعتماد ارزش قائل هستیم. این بدان معنی است که متعهد به حفظ و حراست از تمامی اطلاعات شخصی هستیم که به ما ارائه می‌دهید. از داده های شما عزیزان تنها در راستای ارائه بهتر خدمات رزرو آنلاین به خود شما استفاده خواهیم کرد.</p>
                      <p>ما در سفرانه متعهد می‌شویم که هیچ بخشی از اطلاعات شما را در اختیار دیگران قرار ندهیم،  هیچ بخشی از این اطلاعات را به فروش نمی‌گذاریم و توزیع نخواهیم کرد. فقط در صورت داشتن حکم قانونی، مراجع ذیصلاح، امکان دریافت اطلاعات هریک از کاربران سفرانه را خواهند داشت.</p>
                      <p>اگر خطی و مشی سازمانی به سمتی پیش برود که سفرانه با موسسه دیگری ادغام بشود، اطلاعات شما به مالکان و یا شرکای جدید که ایشان نیز متعهد به حفظ حریم شخصی کاربران هستند، نیز اعلام خواهد شد.</p>
                      <p>از هر پلتفرمی اعم از وبسایت سفرانه، صفحه اینستاگرام رسمی سفرانه و توئیتر رسمی شرکت سفرانه وارد صفحه رزرو هتل های سفرانه بشوید، در هر حال حفظ و نگهداری اطلاعات شما برای ما در بالاترین درجه اهمیت قرار دارد.</p>
                      <p>ممکن است در شرایط مختلف تغییراتی در قوانین حفظ خط و مشی حریم خصوصی ایجاد شود برای اطلاع از این تغییرات به طور دوره‌ای به صفحه حفظ حریم خصوصی سفرانه مراجعه بفرمایید.</p>

                      <h2>سفرانه چه اطلاعات خصوصی را از شما دریافت خواهد کرد؟</h2>
                      <p>سفرانه بدون دریافت یک سری از اطلاعات اولیه مانند نام رزرو کننده، اطلاعات تماس، نام همراهان، کد ملی، قادر به فراهم آوردن یک سفر بی نقص که می‌تواند شامل رزرو آنلاین هتل، رزرو بلیط هواپیما و یا رزرو خدمات Cip فرودگاهی باشد، نخواهد بود.</p>
                      <p>همچنین سامانه سفرانه توسط کوکی‌های اطلاعاتی نظیر ipرایانه، تلفن همراه و یا هر دستگاهی که برای رزرو استفاده می‌کنید را جمع آوری می‌کند.</p>
                      <p>سفرانه از اطلاعات کاربرانش به جهت اطلاع آنها از تخفیف‌های حداکثری، پیشنهادات ویژه رزرو و اخبار رزرو و اجرای کمپین های تبلیغاتی استفاده می‌کند.</p>
                      <h2>جمع آوری اطلاعات کاربران سفرانه توسط کوکی‌ها به چه هدفی انجام می‌شود؟</h2>
                      <p>کوکی‌ها به تسریع روند لاگین کردن کاربران سفرانه در این سامانه کمک می‌کنند. در واقع کوکی‌ها اطلاعات ورود شما، IP، سیستم عامل و زمان ورود را جمع آوری می‌کنند تا با هر بار مراجعه به سامانه سفرانه با سرعت بالاتری به صفحه‌های هدف دسترسی داشته باشید.</p>
                      <p>اگر مخالف این امر هستید، میتوانید با غیر فعال کردن تنظیمات مرورگر خود مانع ذخیره کوکی ها در سفرانه بشوید.</p>
                    </div>
                </div>
            </Col>
        </Row>
      </div>
    </div>
  </Layout>
)

PrivacyPage.getInitialProps = async () => ({
  namespacesRequired: ['common'],
})

PrivacyPage.propTypes = {
  t: PropTypes.func.isRequired,
}

export default withTranslation('common')(PrivacyPage)